Satoru-Kutsuwada/PIC32Dev/FreeRTOS_CLICKER2.X/Source/vl53/usr_i2cMain.c
//=============================================================================
//
//=============================================================================
uint8_t i2c_stop(void)
{
    uint8_t status;
    int index;

    status = STATUS_OK ;    
    I2C_BCL  = 0;

    status = i2c_CheckIdleWait(0x05, __LINE__);

    if( status == STATUS_OK ){
        LOG_PRINT_I2C( "i2c_stop(line %d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );

        I2C_BIF = 0;
        I2C_MIF = 0;

        I2C_PEN = 1;
        LOG_PRINT_I2C( "  ON(PEN) CON=%p, STAT=%x, IFS1=%p\r\n", (uint32_t)I2C_CON,(uint16_t)I2C_STAT,(uint32_t)IFS1 );

        index = Set_Timer(100);
//        while( I2C_PEN  ){
        while( I2C_MIF == 0 ) {
            if(I2C_BCL ){
                Xprintf("  ERR(BCL:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_BCL;      
                status = STATUS_FAIL;    
                break;   

            }
            if(I2C_IWCOL){
                Xprintf( "  ERR(WCOL:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                I2C_IWCOL = 0;
                i2c_data.error = I2C_ERR_STAT_WCOL;        
                status = STATUS_FAIL;    
                break;           
            }
            if( Get_Timer(index) == 0 ){
                Xprintf("  ERR(TOUT:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_TIMEOUT;        
                status = STATUS_FAIL;    
                break;   
            }
        }
        Rel_Timer(index);
    }

    if( status == STATUS_OK ){    
        LOG_PRINT_I2C( "  _end(CON=%p, STAT=%x IFS1=%p)\r\n",(uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
    }

    return  status;
}


//=============================================================================
//
//=============================================================================
uint8_t i2c_write( uint8_t dt )
{
    uint8_t status;
    int index;

    status = STATUS_OK ;    
    I2C_BCL  = 0;

    status = i2c_CheckIdleWait(0x05, __LINE__);

    if( status == STATUS_OK ){
        if( i2c_data.status < I2C_STAT_MAX ){
            LOG_PRINT_I2C( "i2c_write(line%d) dt=0x%x,CON=%p, STAT=%x\r\n",__LINE__, dt, (uint32_t)I2C_CON,(uint16_t)I2C_STAT );
        }
        else{
            LOG_PRINT_I2C("  ERROR STATUS = %d\r\n",i2c_data.status);
        }
        I2C_BIF = 0;
        I2C_MIF = 0;

        I2C_TRN = dt;
        LOG_PRINT_I2C( "  TRN<-%x  CON=%p, STAT=%x, IFS1=%p\r\n",dt, (uint32_t)I2C_CON,(uint16_t)I2C_STAT,(uint32_t)IFS1 );

        index = Set_Timer(100);
        //LOG_PRINT_I2C("  Set_Timer(line%d) %d.%d msec\r\n",__LINE__, usrSRTC.msec, usrSRTC.usec);
 //       while( I2C_TRSTAT ||  I2C_TBF ) {
        while( I2C_MIF == 0 ) {
            
            if(I2C_BCL ){
                Xprintf("  ERR(BCL:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_BCL;      
                status = STATUS_FAIL;    
            }
            if(I2C_IWCOL){
                Xprintf( "  ERR(WCOL:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                I2C_IWCOL = 0;
                i2c_data.error = I2C_ERR_STAT_WCOL;        
                status = STATUS_FAIL;    
                break;           
            }
            if( Get_Timer(index) == 0 ){
                LOG_PRINT_I2C("  ERR(TOUT:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_TIMEOUT;        
                status = STATUS_FAIL;    
                break;   
            }
        }
        Rel_Timer(index);
    
        if( status == STATUS_OK ){
            if( I2C_ACKSTAT ){
                LOG_PRINT_I2C( " ERR(NACK:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_NACK;
                status = STATUS_FAIL;    
            }
            else{
                LOG_PRINT_I2C( "  _end(WRITE ACK line %d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
            }
        }
    }
    
    return  status;
}

//=============================================================================
//
//=============================================================================
uint8_t i2c_read( uint8_t acknNak, uint8_t *dt )
{
    uint8_t status;
    int index;

    status = STATUS_OK ;    
    I2C_BCL  = 0;

    status = i2c_CheckIdleWait(0x05, __LINE__);

    if( status == STATUS_OK ){
        LOG_PRINT_I2C( "i2c_read(line %d) CON=%p, STAT=%x\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT );

        I2C_BIF = 0;
        I2C_MIF = 0;

        I2C_RCEN   = 1;
        LOG_PRINT_I2C( "  ON(RCEN) CON=%p, STAT=%x, IFS1=%p\r\n", (uint32_t)I2C_CON,(uint16_t)I2C_STAT,(uint32_t)IFS1 );

        index = Set_Timer(100);
//        while( I2C_RCEN ){
        while( I2C_MIF == 0 ){
            if(I2C_BCL ){
                Xprintf("  ERR(BCL:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_BCL;      
                status = STATUS_FAIL;    
            }
            if(I2C_IWCOL){
                Xprintf( "  ERR(WCOL:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                I2C_IWCOL = 0;
                i2c_data.error = I2C_ERR_STAT_WCOL;        
                status = STATUS_FAIL;    
                break;           
            }
            if( Get_Timer(index) == 0 ){
                Xprintf("  ERR(TOUT:line%d) CON=%p, STAT=%x IFS1=%p\r\n",__LINE__, (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
                i2c_data.error = I2C_ERR_STAT_TIMEOUT;        
                status = STATUS_FAIL;    
                break;   
            }
        }
        Rel_Timer(index);
    }
    
    if( status == STATUS_OK ){
        *dt = I2C_RCV;
        LOG_PRINT_I2C( "  dt<-RCV(%x) CON=%p, STAT=%x, IFS1=%p\r\n",*dt,  (uint32_t)I2C_CON,(uint16_t)I2C_STAT,(uint32_t)IFS1 );
    
        status = i2c_CheckIdleWait(0x05, __LINE__);

        if( status == STATUS_OK ){
            I2C_ACKDT = acknNak ;        // ACKデータのセット
            I2C_ACKEN = 1 ;          // ACKデータを返す
        }
        LOG_PRINT_I2C( "  _end(line %d)dt=0x%x, CON=%p, STAT=%x IFS1=%p\r\n",__LINE__,*dt,  (uint32_t)I2C_CON,(uint16_t)I2C_STAT, (uint32_t)IFS1 );
    }

    return  status;
}

