Satoru-Kutsuwada/PIC32Dev/FreeRTOS_CLICKER2.X/Source/vl53/usr_i2cMain.c
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        // データ設定
        //++++++++++++++++++++++++++++++++++++++++++++++++++

        i2c_data.address = address;
        i2c_data.index = reg;
        i2c_data.count = count;
        i2c_data.count_step = 0;
        i2c_data.restart_cnt = 0;
        i2c_data.op_type = I2C_READ_MULTI;
        i2c_data.status = I2C_STAT_START;
        i2c_data.error = I2C_NO_ERROR;

        for( i=0; i<count; i++ ){
            i2c_data.dt[i] = 0;
        }

        // 割込みフラグクリア
        I2C_BIF = 0;
        I2C_MIF = 0;

        // 割込みイネーブル
        I2C_BIE = 0;
        I2C_MIE = 0;
        
        

        
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        // 処理
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        while( status == STATUS_OK ){
            LOG_PRINT_I2C("READ MULTI STATUS = %d, CON=%p, STAT=%x\r\n",i2c_data.status, (uint32_t)I2C_CON,(uint16_t)I2C_STAT );
            switch( i2c_data.status ){
                case I2C_STAT_START:
                    status = i2c_start();
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_WITE_ADDRESS_TX;
                    }
                    break;
                case I2C_STAT_WITE_ADDRESS_TX:
                    status = i2c_write(i2c_data.address);
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_INDEX_TX;
                    }
                    break;
                case I2C_STAT_INDEX_TX:
                    status = i2c_write(i2c_data.index);
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_SUSPEND;
                    }
                    break;
                case I2C_STAT_SUSPEND:
                    status = i2c_stop();
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_RESTART;
                    }
                    break;

                case I2C_STAT_RESTART:
                    status = i2c_start();
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_READ_ADDRESS_TX;
                    }
                    break;

                case I2C_STAT_READ_ADDRESS_TX:
                    status = i2c_write(i2c_data.address|0x01);
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_READ;
                    }
                    break;
                case I2C_STAT_READ:
                    
                    if( i2c_data.count_step < i2c_data.count ){
                        if( i2c_data.count_step  < (i2c_data.count-1) )
                            acknack = I2C_SEND_ACK;
                        else
                            acknack = I2C_SEND_NACK;
                       
                        status = i2c_read( acknack, &i2c_data.dt[i2c_data.count_step] );
                        i2c_data.count_step ++;
                    }
                    
                    if( status == STATUS_OK ){
                        if( i2c_data.count_step >= i2c_data.count ){
                            i2c_data.status = I2C_STAT_STOP;
                        }
                    }
                    break;
                case I2C_STAT_STOP:
                    status = i2c_stop();
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_END;
                    }
                    break;
                default:
                    LOG_PRINT_I2C("ERROR (line%d) STATUS = %d\r\n",__LINE__,i2c_data.status);

                    break;
            }
            
            if( status == STATUS_OK ){
                if( i2c_data.status == I2C_STAT_END ){
                    // 正常終了
                    //SetLogDataM( LOG_DISP_NO_DATA, "I2C END",0,0,0,0);
                    

                    for( i=0; i<i2c_data.count ; i++ ){
                        *dst = i2c_data.dt[i];
                        dst ++;
                    }
                    
                    break;
                }
            }
            else{
                // リカバリー処理　今は強制終了
                I2C_ON = 0;


                // 割込みイネーブル
                I2C_BIE = 0;
                I2C_MIE = 0;
        
        


                
                //Wait(1);
                
                if(i2c_data.restart_cnt <I2C_RECOVRY_MAX){
                    i2c_data.restart_cnt ++;

                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    // I2C START
                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    I2C_ON = 1;

                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    // データ設定
                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    status = STATUS_OK;
                    i2c_data.count_step = 0;
                    i2c_data.status = I2C_STAT_START;
                    i2c_data.error = I2C_NO_ERROR;

                    // 割込みフラグクリア
                    I2C_BIF = 0;
                    I2C_MIF = 0;

                    // 割込みイネーブル
                    I2C_BIE = 0;
                    I2C_MIE = 0;
        
        


                    LOG_PRINT_I2C( "RESTART(%p,%x)\r\n",(uint32_t)I2C_CON,(uint16_t)I2C_STAT);
                }
                else{
                    LOG_PRINT_I2C( "ERROR_END\r\n");
                }
            }
        }
    }   

    return  status;
}       
